IDENTIFICATION DIVISION.
PROGRAM-ID. GRADE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 MARKS PIC 9(3).

PROCEDURE DIVISION.

DISPLAY "Enter marks: ".
ACCEPT MARKS.

IF MARKS >= 90
    DISPLAY "Grade A"
ELSE IF MARKS >= 80
    DISPLAY "Grade B"
ELSE IF MARKS >= 70
    DISPLAY "Grade C"
ELSE IF MARKS >= 60
    DISPLAY "Grade D"
ELSE
    DISPLAY "Grade F"
END-IF.

STOP RUN.
