IDENTIFICATION DIVISION.
PROGRAM-ID. CELSIUS-TO-FAHRENHEIT.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 C-TEMP PIC 9(3)V9.
01 F-TEMP PIC 9(3)V9.

PROCEDURE DIVISION.

DISPLAY "Enter Celsius Temperature: ".
ACCEPT C-TEMP.

COMPUTE F-TEMP = (C-TEMP * 9 / 5) + 32.

DISPLAY "Fahrenheit Temperature: " F-TEMP.

STOP RUN.
