IDENTIFICATION DIVISION.
PROGRAM-ID. COMPOUND-INTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 P  PIC 9(7).
01 R  PIC 9(3)V9.
01 T  PIC 9(3).
01 CI PIC 9(9)V9.

PROCEDURE DIVISION.

DISPLAY "Enter Principal: ".
ACCEPT P.

DISPLAY "Enter Rate: ".
ACCEPT R.

DISPLAY "Enter Time: ".
ACCEPT T.

COMPUTE CI = P * (1 + R / 100) ** T.

DISPLAY "Compound Interest: " CI.

STOP RUN.
