IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 N    PIC 9(3).
01 I    PIC 9(3).
01 FACT PIC 9(9) VALUE 1.

PROCEDURE DIVISION.

DISPLAY "Enter a number: ".
ACCEPT N.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > N
    COMPUTE FACT = FACT * I
END-PERFORM.

DISPLAY "Factorial is: " FACT.

STOP RUN.
