IDENTIFICATION DIVISION.
PROGRAM-ID. PALINDROME.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM  PIC 9(5).
01 TEMP PIC 9(5).
01 REV  PIC 9(5) VALUE 0.
01 REM  PIC 9.

PROCEDURE DIVISION.

DISPLAY "Enter number: ".
ACCEPT NUM.

MOVE NUM TO TEMP.

PERFORM UNTIL TEMP = 0
    COMPUTE REM = FUNCTION MOD(TEMP, 10)
    COMPUTE REV = (REV * 10) + REM
    COMPUTE TEMP = TEMP / 10
END-PERFORM.

IF NUM = REV
    DISPLAY "Palindrome Number"
ELSE
    DISPLAY "Not a Palindrome"
END-IF.

STOP RUN.
