IDENTIFICATION DIVISION.
PROGRAM-ID. PRIME-200.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM PIC 9(3).
01 I   PIC 9(3).
01 C   PIC 9(3).

PROCEDURE DIVISION.

PERFORM VARYING NUM FROM 2 BY 1 UNTIL NUM > 200

    MOVE 0 TO C

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
        IF FUNCTION MOD(NUM, I) = 0
            ADD 1 TO C
        END-IF
    END-PERFORM

    IF C = 2
        DISPLAY NUM
    END-IF

END-PERFORM.

STOP RUN.
