IDENTIFICATION DIVISION.
PROGRAM-ID. REVERSE-NUMBER.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM  PIC 9(5).
01 REV  PIC 9(5) VALUE 0.
01 REM  PIC 9.
01 TEMP PIC 9(5).

PROCEDURE DIVISION.

DISPLAY "Enter 5 digit number: ".
ACCEPT NUM.

MOVE NUM TO TEMP.

PERFORM UNTIL TEMP = 0
    COMPUTE REM = FUNCTION MOD(TEMP, 10)
    COMPUTE REV = (REV * 10) + REM
    COMPUTE TEMP = TEMP / 10
END-PERFORM.

DISPLAY "Reversed Number: " REV.

STOP RUN.
