IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE-INTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 P  PIC 9(7).
01 R  PIC 9(3)V9.
01 T  PIC 9(3).
01 SI PIC 9(9)V9.

PROCEDURE DIVISION.

DISPLAY "Enter Principal: ".
ACCEPT P.

DISPLAY "Enter Rate: ".
ACCEPT R.

DISPLAY "Enter Time: ".
ACCEPT T.

COMPUTE SI = (P * R * T) / 100.

DISPLAY "Simple Interest: " SI.

STOP RUN.
