IDENTIFICATION DIVISION.
PROGRAM-ID. SUM20.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM PIC 9(3) OCCURS 20 TIMES.
01 I   PIC 99.
01 S   PIC 9(5) VALUE 0.

PROCEDURE DIVISION.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > 20
    ACCEPT NUM(I)
    COMPUTE S = S + NUM(I)
END-PERFORM.

DISPLAY "SUM = " S.

STOP RUN.
